Autodesk.Revit.DB.Structure.PointLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AnalyticalModel,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.PointLoadType)
Creates a new hosted point load within the project.
aDoc:
Document to which new point load will be added.
host:
The Analytical Isolated Foundation type host element for the point Load.
forceVector:
The applied 3d force vector.
momentVector:
The applied 3d moment vector.
symbol:
The symbol of the PointLoad. Set null to use default type.
Returns:
If successful, returns the newly created PointLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
Thrown when host is not an Analytical Isolated Foundation type host element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created point load.
Since:
2016

Autodesk.Revit.DB.Structure.PointLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AnalyticalModelStick,Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.PointLoadType)
Creates a new hosted point load within the project.
aDoc:
Document to which new point load will be added.
host:
The AnalyticalModelStick (Analytical Beam, Analytical Brace, Analytical Column) host element for the point Load.
selector:
The start or end point of the Analytical stick element.
forceVector:
The applied 3d force vector.
momentVector:
The applied 3d moment vector.
symbol:
The symbol of the PointLoad. Set null to use default type.
Returns:
If successful, returns the newly created PointLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created point load.
Since:
2016